{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        },

        "gr": {
            "title": "Erfahrung",
            "title_long_prefix": "Zusammenfassung meiner",
            "title_long": "**Berufs** erfahrung"
        },

        "ja": {
            "title": "経験",
            "title_long_prefix": "経験",
            "title_long": "**仕事**経験"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/place-1.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "02/01/2020",
                        "end": "01/10/2021"
                    },
                    "locales": {
                        "en": {
                            "title": "Junior **Full-Stack** Developer",
                            "info": "TripActions",
                            "text": "<ul><li>Developed scalable web applications using React.js and Nodes, focusing on enhancing user experience and performance. </li><li>Built RESTful APIs for seamless integration with third-party services and internal systems. </li><li>Collaborated with designers and stakeholders to deliver responsive and user-friendly interfaces.</li><li>Implemented CI/CD pipelines, improving deployment efficiency by 40%.</li><li>Managed databases using MongoDB and PostgreSQL, ensuring data integrity and capability.</li></ul>",
                            "tags": ["PHP", "MySQL", "Laravel"]
                        },
                        "gr": {
                            "title": "Junior **Full-Stack**-Entwickler",
                            "info": "TripActions",
                            "text": "<ul><li>Entwickelte skalierbare Webanwendungen mit React.js und Nodes, mit Schwerpunkt auf der Verbesserung der Benutzererfahrung und Leistung. </li><li>Erstellte RESTful-APIs für die nahtlose Integration mit Diensten von Drittanbietern und internen Systemen. </li><li>Arbeitete mit Designern und Stakeholdern zusammen, um reaktionsschnelle und benutzerfreundliche Schnittstellen bereitzustellen.</li><li>Implementierte CI/CD-Pipelines und verbesserte die Bereitstellungseffizienz um 40 %.</li><li>Verwaltete Datenbanken mit MongoDB und PostgreSQL und stellte Datenintegrität und -fähigkeit sicher.</li></ul>",
                            "tags": ["PHP", "MySQL", "Laravel"]
                        },
                        "ja": {
                            "title": "ジュニア **フルスタック** 開発者",
                            "info": "TripActions",
                            "text": "<ul><li>React.js と Nodes を使用してスケーラブルな Web アプリケーションを開発し、ユーザー エクスペリエンスとパフォーマンスの向上に重点を置きました。</li><li>サードパーティのサービスや内部システムとのシームレスな統合のために RESTful API を構築しました。</li><li>デザイナーや関係者と協力して、応答性に優れたユーザー フレンドリーなインターフェイスを提供しました。</li><li>CI/CD パイプラインを実装し、展開効率を 40% 向上しました。</li><li>MongoDB と PostgreSQL を使用してデータベースを管理し、データの整合性と機能を確保しました。</li></ul>",
                            "tags": ["PHP", "MySQL", "Laravel"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-2.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "01/15/2021",
                        "end": "08/01/2022"
                    },
                    "locales": {
                        "en": {
                            "title": "**Frontend Developer** and **Web3** Specialist",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>Attended to Developing decentralized exchange (DEX) platforms with seamless user interfaces and wallet integrations using Web3js.</li><li>Implemented wallet connectivity features, including MetaMask and Wallet Connect, to support multiple blockchain networks. </li><li>Created reusable UI components for DEX trading dashboards, improving development consistency and scalability </li><li>Conducted blockchain data analysis and integrated token price trackers via APIs. </li><li>Collaborated with backend developers to ensure secure smart contract deployment and data synchronization.</li></ul>",
                            "tags": ["JavaScript", "React", "Node.js", "PHP", "REST", "Docker"]
                        },
                        "gr": {
                            "title": "**Frontend-Entwickler** und **Web3**-Spezialist",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>Entwicklung von dezentralen Börsenplattformen (DEX) mit nahtlosen Benutzeroberflächen und Wallet-Integrationen unter Verwendung von Web3js.</li><li>Implementierung von Wallet-Konnektivitätsfunktionen, einschließlich MetaMask und Wallet Connect, zur Unterstützung mehrerer Blockchain-Netzwerke.</li><li>Erstellung wiederverwendbarer UI-Komponenten für DEX-Handels-Dashboards zur Verbesserung der Entwicklungskonsistenz und Skalierbarkeit.</li><li>Durchführung einer Blockchain-Datenanalyse und Integration von Token-Preis-Trackern über APIs.</li><li>Zusammenarbeit mit Backend-Entwicklern zur Gewährleistung einer sicheren Bereitstellung von Smart Contracts und Datensynchronisierung.</li></ul>",
                            "tags": ["JavaScript", "React", "Node.js", "PHP", "REST", "Docker"]
                        },
                        "ja": {
                            "title": "**フロントエンド開発者** および **Web3** スペシャリスト",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>Web3js を使用して、シームレスなユーザー インターフェイスとウォレット統合を備えた分散型取引所 (DEX) プラットフォームの開発に携わりました。</li><li>MetaMask や Wallet Connect などのウォレット接続機能を実装し、複数のブロックチェーン ネットワークをサポートしました。</li><li>DEX 取引ダッシュボードの再利用可能な UI コンポーネントを作成し、開発の一貫性とスケーラビリティを向上させました。</li><li>ブロックチェーン データ分析を実施し、API を介してトークン価格トラッカーを統合しました。</li><li>バックエンド開発者と協力して、安全なスマート コントラクトの展開とデータ同期を確保しました。</li></ul>",
                            "tags": ["JavaScript", "React", "Node.js", "PHP", "REST", "Docker"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-3.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "8/01/2022",
                        "end": "11/01/2024"
                    },
                    "locales": {
                        "en": {
                            "title": "**Senior Full stack and mobile** Developer",
                            "info": "Rave Digital",
                            "text": "<p>Contributed as a **Full stack** developer:</p> <ul><li>Developed and customized e-commerce stores using Shopify and WordPress, optimizing sales funnel and checkout experiences.</li><li>Led the migration of legacy systems to modern architectures, improving performance by 40%.</li><li>Created reusable React.js components for consistent UI development, reducing development time by 30%.</li><li>Managed RESTful API and GraphQL integrations for dynamic data handling.</li><li>Optimized SEO and performance metrics, improving site visibility and traffic by 25%.</li></ul><br/><p>Contributed as a **Mobile** developer:</p><ul><li>Built cross-platform mobile applications using React Native, Swift for e-commerce and utility platforms.</li><li>Deployed applications to the App Store and Google Play, achieving over 5000 downloads within the first three months.</li><li>Integrated Firebase for real-time database synchronization and push notifications.</li></ul>",
                            "tags": ["Swift", "PostgreSQL", "GraphQL", "RESTful APIs", "PHP"]
                        },
                        "gr": {
                            "title": "**Senior Full Stack und Mobile** Entwickler",
                            "info": "Rave Digital",
                            "text": "<p>Beitrag als **Full Stack** Entwickler:</p> <ul><li>Entwicklung und Anpassung von E-Commerce-Shops mit Shopify und WordPress, Optimierung von Sales Funnel und Checkout-Erlebnissen.</li><li>Leitung der Migration von Legacy-Systemen auf moderne Architekturen, Leistungssteigerung um 40 %.</li><li>Erstellung wiederverwendbarer React.js-Komponenten für konsistente UI-Entwicklung, Reduzierung der Entwicklungszeit um 30 %.</li><li>Verwaltung von RESTful API und GraphQL-Integrationen für dynamische Datenverarbeitung.</li><li>Optimierung von SEO und Leistungsmetriken, Verbesserung der Site-Sichtbarkeit und des Traffics um 25 %.</li></ul><br/><p>Beitrag als **Mobile** Entwickler:</p><ul><li>Erstellung plattformübergreifender mobiler Anwendungen mit React Native, Swift für E-Commerce- und Utility-Plattformen.</li><li>Bereitstellung von Anwendungen im App Store und Google Play, wo innerhalb der ersten drei Monate über 5000 Downloads erzielt wurden.</li><li>Integrierte Firebase für Echtzeit-Datenbanksynchronisierung und Push-Benachrichtigungen.</li></ul>",
                            "tags": ["Swift", "PostgreSQL", "GraphQL", "RESTful APIs", "PHP"]
                        },
                        "ja": {
                            "title": "**シニア フルスタックおよびモバイル** 開発者",
                            "info": "Rave Digital",
                            "text": "<p>**フルスタック** 開発者として貢献:</p> <ul><li>Shopify と WordPress を使用して e コマース ストアを開発およびカスタマイズし、セールス ファネルとチェックアウト エクスペリエンスを最適化しました。</li><li>レガシー システムから最新のアーキテクチャへの移行を主導し、パフォーマンスを 40% 向上しました。</li><li>一貫性のある UI 開発のために再利用可能な React.js コンポーネントを作成し、開発時間を 30% 短縮しました。</li><li>動的なデータ処理のために RESTful API と GraphQL の統合を管理しました。</li><li>SEO とパフォーマンス メトリックを最適化し、サイトの可視性とトラフィックを 25% 向上しました。</li></ul><br/><p>**モバイル** 開発者として貢献:</p><ul><li>e コマースおよびユーティリティ プラットフォーム向けに React Native、Swift を使用してクロスプラットフォーム モバイル アプリケーションを構築しました。</li><li>アプリケーションをデプロイしましたApp Store と Google Play にリリースされ、最初の 3 か月で 5,000 回以上のダウンロードを達成しました。</li><li>リアルタイムのデータベース同期とプッシュ通知のために Firebase を統合しました。</li></ul>",
                            "tags": ["Swift", "PostgreSQL", "GraphQL", "RESTful APIs", "PHP"]
                        }
                    }
                }
            ]
        }
    ]
}
