{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        },

        "gr": {
            "title": "Erfahrung",
            "title_long_prefix": "Zusammenfassung meiner",
            "title_long": "**Berufs** erfahrung"
        },

        "ja": {
            "title": "経験",
            "title_long_prefix": "経験",
            "title_long": "**仕事**経験"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/place-1.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "11/01/2019",
                        "end": "01/10/2021"
                    },
                    "locales": {
                        "en": {
                            "title": "Junior **Full-Stack** | **Mobile** Developer",
                            "info": "TripActions",
                            "text": "<ul><li>Developed scalable web applications using React.js, Vue.js, Angular.js and Express.js, Nest.js, Laravel, Django, Flask focusing on enhancing user experience and performance.</li><li>Collaborated with designers and stakeholders to deliver responsive and user-friendly interfaces, employing tools like Figma for design collaboration and prototyping.</li><li>Implemented CI/CD pipelines using Jenkins and GitHub Actions, improving deployment efficiency by 40% through automated testing and deployment processes.</li><li>Managed databases using MongoDB and PostgreSQL, ensuring data integrity and capability through schema design and indexing strategies.</li><li>Built cross-platform mobile applications using React Native and Swift, targeting e-commerce and utility platforms, with successful deployments to the App Store and Google Play</li></ul>",
                            "tags": ["React.js","Vue.js", "PostgreSQL", "Laravel","Flask", "Swift"]
                        },
                        "gr": {
                            "title": "Junior **Full-Stack** | **Mobile** Developer",
                            "info": "TripActions",
                            "text": "<ul><li>Entwickelte skalierbare Webanwendungen mit React.js, Vue.js, Angular.js und Express.js, Nest.js, Laravel, Django, Flask mit dem Schwerpunkt auf der Verbesserung der Benutzererfahrung und -leistung.</li><li>Arbeitete mit Designern und Stakeholdern zusammen, um reaktionsschnelle und benutzerfreundliche Schnittstellen bereitzustellen, und setzte Tools wie Figma für die Designzusammenarbeit und das Prototyping ein.</li><li>Implementierte CI/CD-Pipelines mit Jenkins und GitHub Actions und verbesserte die Bereitstellungseffizienz durch automatisierte Test- und Bereitstellungsprozesse um 40 %.</li><li>Verwaltete Datenbanken mit MongoDB und PostgreSQL und stellte durch Schemadesign und Indizierungsstrategien Datenintegrität und -fähigkeit sicher.</li><li>Erstellte plattformübergreifende mobile Anwendungen mit React Native und Swift für E-Commerce- und Utility-Plattformen mit erfolgreichen Bereitstellungen im App Store und bei Google Spielen</li></ul>",
                            "tags": ["React.js","Vue.js", "PostgreSQL", "Laravel","Flask", "Swift"]

                        },
                        "ja": {
                            "title": "ジュニア **フルスタック** | **モバイル** 開発者",
                            "info": "TripActions",
                            "text": "<ul><li>React.js、Vue.js、Angular.js、Express.js、Nest.js、Laravel、Django、Flask を使用して、ユーザー エクスペリエンスとパフォーマンスの向上に重点を置いたスケーラブルな Web アプリケーションを開発しました。</li><li>デザイナーや関係者と協力して、Figma などのツールをデザインのコラボレーションとプロトタイピングに使用し、レスポンシブでユーザー フレンドリーなインターフェイスを提供しました。</li><li>Jenkins と GitHub Actions を使用して CI/CD パイプラインを実装し、自動化されたテストとデプロイメント プロセスによってデプロイメント効率を 40% 向上しました。</li><li>MongoDB と PostgreSQL を使用してデータベースを管理し、スキーマ設計とインデックス戦略を通じてデータの整合性と機能を確保しました。</li><li>React Native と Swift を使用して、e コマースとユーティリティ プラットフォームをターゲットにしたクロスプラットフォーム モバイル アプリケーションを構築し、 App Store と Google Play</li></ul>",
                            "tags": ["React.js","Vue.js", "PostgreSQL", "Laravel","Flask", "Swift"]

                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-2.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "01/15/2021",
                        "end": "08/01/2022"
                    },
                    "locales": {
                        "en": {
                            "title": "**Frontend Developer** and **Web3** Specialist",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>Attended to Solana based DEX platform with seamless user interfaces and wallet integrations using Solana Web3.js for blockchain interactions.</li><li>Reduced platform development time by 30% and ensuring consistent UI across applications by creating reusable React.js components with Redux toolkit for state management and Tailwind CSS, SCSS, MUI for styling.</li><li>Implemented wallet connectivity features, including Metamask and Phantom, to support multiple blockchain networks, using solana sdk libraries like @solana/spl-token, @solana/web3.js and so on.</li><li>Conducted blockchain data analysis and integrated token price trackers via third-party APIs such as CoinGecko API and CoinMarketCap API to provide real-time market data and enhance user engagement.</li></ul>",
                            "tags": ["Next.js", "Node.js", "Web3.js", "Docker"]
                        },
                        "gr": {
                            "title": "**Frontend-Entwickler** und **Web3**-Spezialist",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>Betreuung einer Solana-basierten DEX-Plattform mit nahtlosen Benutzeroberflächen und Wallet-Integrationen unter Verwendung von Solana Web3.js für Blockchain-Interaktionen.</li><li>Reduzierung der Plattformentwicklungszeit um 30 % und Sicherstellung einer konsistenten Benutzeroberfläche über alle Anwendungen hinweg durch Erstellen wiederverwendbarer React.js-Komponenten mit Redux-Toolkit für die Statusverwaltung und Tailwind CSS, SCSS, MUI für das Styling.</li><li>Implementierung von Wallet-Konnektivitätsfunktionen, einschließlich Metamask und Phantom, zur Unterstützung mehrerer Blockchain-Netzwerke unter Verwendung von Solana-SDK-Bibliotheken wie @solana/spl-token, @solana/web3.js usw.</li><li>Durchführung einer Blockchain-Datenanalyse und Integration von Token-Preis-Trackern über APIs von Drittanbietern wie CoinGecko API und CoinMarketCap API zur Bereitstellung von Marktdaten in Echtzeit und Verbesserung der Benutzerinteraktion.</li></ul>",
                            "tags": ["Next.js", "Node.js", "Web3.js", "Docker"]
                        },
                        "ja": {
                            "title": "**フロントエンド開発者** および **Web3** スペシャリスト",
                            "info": "Rising Tide Software",
                            "text": "<ul><li>ブロックチェーン インタラクションに Solana Web3.js を使用して、シームレスなユーザー インターフェイスとウォレット統合を備えた Solana ベースの DEX プラットフォームに取り組みました。</li><li>状態管理用の Redux ツールキットとスタイリング用の Tailwind CSS、SCSS、MUI を使用して再利用可能な React.js コンポーネントを作成することで、プラットフォームの開発時間を 30% 短縮し、アプリケーション間で一貫した UI を確保しました。</li><li>@solana/spl-token、@solana/web3.js などの Solana SDK ライブラリを使用して、Metamask や Phantom などのウォレット接続機能を実装し、複数のブロックチェーン ネットワークをサポートしました。</li><li>CoinGecko API や CoinMarketCap API などのサードパーティ API を介してブロックチェーン データ分析を実施し、トークン価格トラッカーを統合して、リアルタイムの市場データを提供し、ユーザー エンゲージメントを強化しました。</li></ul>",
                            "tags": ["Next.js", "Node.js", "Web3.js", "Docker"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-3.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "8/01/2022",
                        "end": "11/01/2024"
                    },
                    "locales": {
                        "en": {
                            "title": "Senior **Full stack** and **E-commerce** Developer",
                            "info": "Rave Digital",
                            "text": "<ul><li>Developed and customized e-commerce stores using Shopify (Liquid, APIs) and WordPress (Custom Themes, WooCommerce), optimizing sales funnels and checkout experiences through A/B testing and user feedback analysis.</li><li>Integrated third-party payment gateways like Stripe, PayPal, and inventory management systems like TradeGecko, Skubana to streamline business operations and improve transaction efficiency</li><li>Developed and deployed Progressive Web Apps (PWAs) to improve mobile user experiences, utilizing Workbox for service worker management and offline capabilities.</li><li>Managed RESTful API and GraphQL integrations using tools like Google Analytics and PageSpeed Insights, resulting in a 25% increase in site visibility and traffic.</li><li>Optimized SEO and performance metrics, improving site visibility and traffic by 25% through strategies like schema markup and image optimization</li></ul>",
                            "tags": ["PostgreSQL", "Wordpress","GraphQL", "PHP", "PWAs", "SEO"]
                        },
                        "gr": {
                            "title": "Senior **ull Stack** und **E-Commerce** Entwickler",
                            "info": "Rave Digital",
                            "text": "<ul><li>Entwicklung und Anpassung von E-Commerce-Shops mit Shopify (Liquid, APIs) und WordPress (Custom Themes, WooCommerce), Optimierung von Sales Funnels und Checkout-Erlebnissen durch A/B-Tests und Analyse des Benutzerfeedbacks.</li><li>Integration von Drittanbieter-Zahlungsgateways wie Stripe, PayPal und Bestandsverwaltungssysteme wie TradeGecko, Skubana zur Rationalisierung der Geschäftsabläufe und Verbesserung der Transaktionseffizienz.</li><li>Entwicklung und Bereitstellung von Progressive Web Apps (PWAs) zur Verbesserung des mobilen Benutzererlebnisses, Nutzung von Workbox für die Verwaltung von Servicemitarbeitern und Offline-Funktionen.</li><li>Verwaltung von RESTful API- und GraphQL-Integrationen mit Tools wie Google Analytics und PageSpeed ​​Insights, was zu einer 25 %igen Steigerung der Site-Sichtbarkeit und des Traffics führte.</li><li>Optimierung von SEO und Leistungsmetriken, Verbesserung der Site-Sichtbarkeit und des Traffics um 25 % durch Strategien wie Schema-Markup und Bild Optimierung</li></ul>",
                            "tags": ["PostgreSQL", "Wordpress", "GraphQL", "PHP", "PWAs", "SEO"]
                        },
                        "ja": {
                            "title": "シニア **フルスタック** および **Eコマース** 開発者",
                            "info": "Rave Digital",
                            "text": "<ul><li>Shopify (Liquid、API) と WordPress (カスタム テーマ、WooCommerce) を使用して e コマース ストアを開発およびカスタマイズし、A/B テストとユーザー フィードバック分析を通じてセールス ファネルとチェックアウト エクスペリエンスを最適化しました。</li><li>Stripe、PayPal などのサードパーティの支払いゲートウェイと TradeGecko、Skubana などの在庫管理システムを統合して、ビジネス オペレーションを合理化し、トランザクションの効率を改善しました。</li><li>Workbox を使用してサービス ワーカー管理とオフライン機能を活用し、モバイル ユーザー エクスペリエンスを向上させるためにプログレッシブ ウェブ アプリ (PWA) を開発および展開しました。</li><li>Google Analytics や PageSpeed Insights などのツールを使用して RESTful API と GraphQL の統合を管理し、サイトの可視性とトラフィックを 25% 増加させました。</li><li>SEO とパフォーマンス メトリックを最適化し、スキーマ マークアップやイメージなどの戦略を通じてサイトの可視性とトラフィックを 25% 向上させました。最適化</li></ul>",
                            "tags": ["PostgreSQL", "Wordpress", "GraphQL", "PHP", "PWAs", "SEO"]
                        }
                    }
                }
            ]
        }
    ]
}
